# Import da biblioteca pandas

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('titanic/train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# Renomeando colunas

In [5]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 
                'IrmaosConjuge','PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

# Groupby

In [6]:
data[['Sexo','Sobreviveu', 'Classe', 'Idade', 'Tarifa']].groupby('Sexo').mean()

        Sobreviveu    Classe      Idade     Tarifa
Sexo
female    0.742038  2.159236  27.915709  44.479818
male      0.188908  2.389948  30.726645  25.523893

In [7]:
data[['Embarque', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].groupby('Embarque').mean()

          Sobreviveu    Classe      Idade     Tarifa
Embarque
C           0.553571  1.886905  30.814769  59.954144
Q           0.389610  2.909091  28.089286  13.276030
S           0.336957  2.350932  29.445397  27.079812

In [8]:
data[['Embarque', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].groupby('Sobreviveu').mean()

              Classe      Idade     Tarifa
Sobreviveu
0           2.531876  30.626179  22.117887
1           1.950292  28.343690  48.395408

In [9]:
data[['Embarque', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].groupby('Classe').mean()

        Sobreviveu      Idade     Tarifa
Classe
1         0.629630  38.233441  84.154687
2         0.472826  29.877630  20.662183
3         0.242363  25.140620  13.675550

In [10]:
data[['Embarque', 'Sexo', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].groupby(['Embarque', 'Sexo']).mean()

                 Sobreviveu    Classe      Idade     Tarifa
Embarque Sexo
C        female    0.876712  1.726027  28.344262  75.169805
         male      0.305263  2.010526  32.998841  48.262109
Q        female    0.750000  2.888889  24.291667  12.634958
         male      0.073171  2.926829  30.937500  13.838922
S        female    0.689655  2.197044  27.771505  38.740929
         male      0.174603  2.421769  30.291440  21.711996

In [11]:
data[['Embarque', 'Sexo', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].loc[data['Sexo'] == 'female'].groupby(['Tarifa', 'Sexo']).mean()

                 Sobreviveu  Classe      Idade
Tarifa   Sexo
6.7500   female    0.000000     3.0  18.000000
7.2250   female    1.000000     3.0  15.000000
7.2292   female    1.000000     3.0  13.000000
7.2500   female    1.000000     3.0  22.000000
7.4958   female    1.000000     3.0  18.000000
7.5500   female    0.500000     3.0  23.000000
7.6292   female    0.000000     3.0        NaN
7.6500   female    1.000000     3.0  21.000000
7.7333   female    1.000000     3.0  16.000000
7.7375   female    1.000000     3.0        NaN
7.7500   female    0.666667     3.0  26.083333
7.7750   female    0.333333     3.0  21.666667
7.7875   female    1.000000     3.0        NaN
7.8292   female    1.000000     3.0        NaN
7.8542   female    0.500000     3.0  22.500000
7.8792   female    1.000000     3.0  19.000000
7.8958   female    0.000000     3.0  28.000000
7.9250   female    0.600000     3.0  23.600000
8.0292   female    1.000000     3.0  15.000000
8.0500   female    0.000000     3.0        NaN
8.1375   female    0.000000     3.0        NaN
8.6625   female    0.000000     3.0  25.000000
8.6833   female    1.000000     3.0  31.000000
8.8500   female    0.000000     3.0  24.000000
9.3500   female    1.000000     3.0  18.000000
9.4750   female    0.000000     3.0  40.000000
9.5875   female    0.500000     3.0  50.000000
9.8250   female    0.000000     3.0  20.500000
9.8375   female    0.000000     3.0  22.000000
9.8417   female    1.000000     3.0  18.000000
...                     ...     ...        ...
78.8500  female    1.000000     1.0  26.000000
79.2000  female    1.000000     1.0        NaN
79.6500  female    1.000000     1.0  28.500000
80.0000  female    1.000000     1.0  50.000000
82.1708  female    1.000000     1.0        NaN
83.1583  female    1.000000     1.0  39.666667
83.4750  female    1.000000     1.0  35.000000
86.5000  female    1.000000     1.0  26.333333
89.1042  female    1.000000     1.0        NaN
90.0000  female    1.000000     1.0  34.000000
91.0792  female    1.000000     1.0  19.000000
93.5000  female    1.000000     1.0  41.000000
106.4250 female    1.000000     1.0  30.000000
108.9000 female    1.000000     1.0  17.000000
110.8833 female    1.000000     1.0  39.000000
113.2750 female    1.000000     1.0  27.000000
120.0000 female    1.000000     1.0  25.000000
133.6500 female    1.000000     1.0        NaN
134.5000 female    1.000000     1.0  40.500000
135.6333 female    1.000000     1.0  35.500000
146.5208 female    1.000000     1.0  58.000000
151.5500 female    0.333333     1.0  16.333333
153.4625 female    1.000000     1.0  49.000000
164.8667 female    1.000000     1.0  38.000000
211.3375 female    1.000000     1.0  29.000000
227.5250 female    1.000000     1.0  32.666667
247.5208 female    1.000000     1.0  50.000000
262.3750 female    1.000000     1.0  19.500000
263.0000 female    1.000000     1.0  23.500000
512.3292 female    1.000000     1.0  35.000000

[156 rows x 3 columns]

In [12]:
data[['Embarque', 'Sexo', 'Sobreviveu', 'Classe', 'Idade', 'Tarifa']].loc[data['Sexo'] == 'male']\
.groupby(['Embarque', 'Sexo', 'Sobreviveu', 'Tarifa']).mean()

                                   Classe      Idade
Embarque Sexo Sobreviveu Tarifa
C        male 0          4.0125      3.00  20.000000
                         6.4375      3.00  34.500000
                         7.2250      3.00  35.125000
                         7.2292      3.00  22.666667
                         7.8958      3.00  34.000000
                         8.6625      3.00  33.000000
                         8.7125      3.00        NaN
                         12.8750     2.00  36.000000
                         14.4542     3.00  26.500000
                         14.4583     3.00        NaN
                         15.0458     2.00  23.000000
                         15.0500     2.00        NaN
                         18.7875     3.00  11.000000
                         21.6792     3.00        NaN
                         24.0000     2.00  30.000000
                         27.7208     1.25  34.500000
                         27.7500     1.00  30.000000
                         29.7000     1.00  47.500000
                         30.0708     2.00  32.500000
                         30.6958     1.00  56.000000
                         34.6542     1.00  71.000000
                         37.0042     2.00  31.000000
                         39.6000     1.00        NaN
                         40.1250     1.00  36.000000
                         41.5792     2.00  25.000000
                         49.5042     1.00  71.000000
                         61.3792     1.00  51.000000
                         61.9792     1.00  65.000000
                         79.2000     1.00  35.000000
                         82.1708     1.00  28.000000
...                                   ...        ...
S        male 1          10.5000     2.00  40.500000
                         11.1333     3.00   4.000000
                         12.4750     3.00   6.000000
                         13.0000     2.00  35.666667
                         14.5000     2.00   0.670000
                         15.9000     3.00   6.000000
                         18.7500     2.00   1.915000
                         20.5250     3.00   9.000000
                         20.5750     3.00   1.000000
                         26.0000     2.00  12.333333
                         26.2875     1.00  37.666667
                         26.3875     1.00  36.000000
                         26.5500     1.00  41.200000
                         29.0000     2.00   0.830000
                         30.0000     1.00  80.000000
                         30.5000     1.00  39.500000
                         31.3875     3.00   3.000000
                         35.5000     1.00  28.000000
                         36.7500     2.00   8.000000
                         39.0000     2.00   1.000000
                         52.0000     1.00  48.000000
                         52.5542     1.00  39.500000
                         53.1000     1.00  27.000000
                         56.4958     3.00  30.000000
                         57.0000     1.00  31.000000
                         81.8583     1.00   4.000000
                         90.0000     1.00  38.000000
                         120.0000    1.00  23.500000
                         133.6500    1.00  50.000000
                         151.5500    1.00   0.920000

[238 rows x 2 columns]

In [13]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

## Crosstab

In [14]:
pd.crosstab(data['Sobreviveu'], data['Classe'], margins=True)

Classe        1    2    3  All
Sobreviveu
0            80   97  372  549
1           136   87  119  342
All         216  184  491  891

In [15]:
pd.crosstab(data['Sobreviveu'], data['Sexo'], margins=True).style.background_gradient(cmap='Blues')

In [16]:
pd.crosstab(data['Sobreviveu'], data['Sexo'], margins=True).style.background_gradient(cmap='OrRd')

In [17]:
pd.crosstab(data['Sexo'], data['Tarifa'])

Tarifa,0.0,4.0125,5.0,6.2375,6.4375,6.45,6.4958,6.75,6.8583,6.95,...,153.4625,164.8667,211.3375,211.5,221.7792,227.525,247.5208,262.375,263.0,512.3292
Sexo,,,,,,,,,,,,,,,,,,,,,
female,0,0,0,0,0,0,0,1,0,0,...,2,2,3,0,0,3,1,2,2,1
male,15,1,1,1,1,1,2,1,1,1,...,1,0,0,1,1,1,1,0,2,2

In [18]:
pd.crosstab(data['Classe'], data['Sobreviveu'])

Sobreviveu    0    1
Classe
1            80  136
2            97   87
3           372  119

In [19]:
pd.crosstab(data['Sexo'], data['Idade'])

Idade,0.42,0.67,0.75,0.83,0.92,1.0,2.0,3.0,4.0,5.0,...,62.0,63.0,64.0,65.0,66.0,70.0,70.5,71.0,74.0,80.0
Sexo,,,,,,,,,,,,,,,,,,,,,
female,0,0,2,0,0,2,6,2,5,4,...,1,2,0,0,0,0,0,0,0,0
male,1,1,0,2,1,5,4,4,5,0,...,3,0,2,3,1,2,1,2,1,1

In [20]:
pd.crosstab(data['Idade'], data['Embarque'])

Embarque  C  Q   S
Idade
0.42      1  0   0
0.67      0  0   1
0.75      2  0   0
0.83      0  0   2
0.92      0  0   1
1.00      2  0   5
2.00      0  1   9
3.00      1  0   5
4.00      1  1   8
5.00      1  0   3
6.00      0  0   3
7.00      0  1   2
8.00      0  1   3
9.00      1  0   7
10.00     0  0   2
11.00     1  0   3
12.00     1  0   0
13.00     1  0   1
14.00     2  0   4
14.50     1  0   0
15.00     3  1   1
16.00     1  2  14
17.00     5  0   8
18.00     4  1  21
19.00     1  2  22
20.00     3  0  12
20.50     0  0   1
21.00     1  2  21
22.00     5  1  21
23.00     4  0  11
...      .. ..  ..
44.00     2  1   6
45.00     1  0  11
45.50     1  0   1
46.00     1  0   2
47.00     0  0   9
48.00     2  0   7
49.00     4  0   2
50.00     3  0   7
51.00     1  0   6
52.00     1  0   5
53.00     0  0   1
54.00     2  0   6
55.00     0  0   2
55.50     0  0   1
56.00     3  0   1
57.00     0  1   1
58.00     3  0   2
59.00     0  0   2
60.00     2  0   2
61.00     0  0   3
62.00     0  0   3
63.00     0  0   2
64.00     0  0   2
65.00     1  1   1
66.00     0  0   1
70.00     0  0   2
70.50     0  1   0
71.00     2  0   0
74.00     0  0   1
80.00     0  0   1

[88 rows x 3 columns]

## Ordenar dados

In [21]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_values('Idade', ascending=True)

     Idade    Sexo  Classe  Sobreviveu
803   0.42    male       3           1
755   0.67    male       2           1
644   0.75  female       3           1
469   0.75  female       3           1
78    0.83    male       2           1
831   0.83    male       2           1
305   0.92    male       1           1
827   1.00    male       2           1
381   1.00  female       3           1
164   1.00    male       3           0
183   1.00    male       2           1
386   1.00    male       3           0
172   1.00  female       3           1
788   1.00    male       3           1
642   2.00  female       3           0
7     2.00    male       3           0
530   2.00  female       2           1
297   2.00  female       1           0
824   2.00    male       3           0
205   2.00  female       3           0
119   2.00  female       3           0
340   2.00    male       2           1
479   2.00  female       3           1
16    2.00    male       3           0
348   3.00    male       3           1
407   3.00    male       2           1
374   3.00  female       3           0
261   3.00    male       3           1
43    3.00  female       2           1
193   3.00    male       2           1
..     ...     ...     ...         ...
718    NaN    male       3           0
727    NaN  female       3           1
732    NaN    male       2           0
738    NaN    male       3           0
739    NaN    male       3           0
740    NaN    male       1           1
760    NaN    male       3           0
766    NaN    male       1           0
768    NaN    male       3           0
773    NaN    male       3           0
776    NaN    male       3           0
778    NaN    male       3           0
783    NaN    male       3           0
790    NaN    male       3           0
792    NaN  female       3           0
793    NaN    male       1           0
815    NaN    male       1           0
825    NaN    male       3           0
826    NaN    male       3           0
828    NaN    male       3           1
832    NaN    male       3           0
837    NaN    male       3           0
839    NaN    male       1           1
846    NaN    male       3           0
849    NaN  female       1           1
859    NaN    male       3           0
863    NaN  female       3           0
868    NaN    male       3           0
878    NaN    male       3           0
888    NaN  female       3           0

[891 rows x 4 columns]

In [22]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_values('Idade', ascending=True)

     Idade    Sexo  Classe  Sobreviveu
803   0.42    male       3           1
755   0.67    male       2           1
644   0.75  female       3           1
469   0.75  female       3           1
78    0.83    male       2           1
831   0.83    male       2           1
305   0.92    male       1           1
827   1.00    male       2           1
381   1.00  female       3           1
164   1.00    male       3           0
183   1.00    male       2           1
386   1.00    male       3           0
172   1.00  female       3           1
788   1.00    male       3           1
642   2.00  female       3           0
7     2.00    male       3           0
530   2.00  female       2           1
297   2.00  female       1           0
824   2.00    male       3           0
205   2.00  female       3           0
119   2.00  female       3           0
340   2.00    male       2           1
479   2.00  female       3           1
16    2.00    male       3           0
348   3.00    male       3           1
407   3.00    male       2           1
374   3.00  female       3           0
261   3.00    male       3           1
43    3.00  female       2           1
193   3.00    male       2           1
..     ...     ...     ...         ...
718    NaN    male       3           0
727    NaN  female       3           1
732    NaN    male       2           0
738    NaN    male       3           0
739    NaN    male       3           0
740    NaN    male       1           1
760    NaN    male       3           0
766    NaN    male       1           0
768    NaN    male       3           0
773    NaN    male       3           0
776    NaN    male       3           0
778    NaN    male       3           0
783    NaN    male       3           0
790    NaN    male       3           0
792    NaN  female       3           0
793    NaN    male       1           0
815    NaN    male       1           0
825    NaN    male       3           0
826    NaN    male       3           0
828    NaN    male       3           1
832    NaN    male       3           0
837    NaN    male       3           0
839    NaN    male       1           1
846    NaN    male       3           0
849    NaN  female       1           1
859    NaN    male       3           0
863    NaN  female       3           0
868    NaN    male       3           0
878    NaN    male       3           0
888    NaN  female       3           0

[891 rows x 4 columns]

In [23]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_index(ascending=True)

     Idade    Sexo  Classe  Sobreviveu
0     22.0    male       3           0
1     38.0  female       1           1
2     26.0  female       3           1
3     35.0  female       1           1
4     35.0    male       3           0
5      NaN    male       3           0
6     54.0    male       1           0
7      2.0    male       3           0
8     27.0  female       3           1
9     14.0  female       2           1
10     4.0  female       3           1
11    58.0  female       1           1
12    20.0    male       3           0
13    39.0    male       3           0
14    14.0  female       3           0
15    55.0  female       2           1
16     2.0    male       3           0
17     NaN    male       2           1
18    31.0  female       3           0
19     NaN  female       3           1
20    35.0    male       2           0
21    34.0    male       2           1
22    15.0  female       3           1
23    28.0    male       1           1
24     8.0  female       3           0
25    38.0  female       3           1
26     NaN    male       3           0
27    19.0    male       1           0
28     NaN  female       3           1
29     NaN    male       3           0
..     ...     ...     ...         ...
861   21.0    male       2           0
862   48.0  female       1           1
863    NaN  female       3           0
864   24.0    male       2           0
865   42.0  female       2           1
866   27.0  female       2           1
867   31.0    male       1           0
868    NaN    male       3           0
869    4.0    male       3           1
870   26.0    male       3           0
871   47.0  female       1           1
872   33.0    male       1           0
873   47.0    male       3           0
874   28.0  female       2           1
875   15.0  female       3           1
876   20.0    male       3           0
877   19.0    male       3           0
878    NaN    male       3           0
879   56.0  female       1           1
880   25.0  female       2           1
881   33.0    male       3           0
882   22.0  female       3           0
883   28.0    male       2           0
884   25.0    male       3           0
885   39.0  female       3           0
886   27.0    male       2           0
887   19.0  female       1           1
888    NaN  female       3           0
889   26.0    male       1           1
890   32.0    male       3           0

[891 rows x 4 columns]

In [24]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_index(ascending=False)

     Idade    Sexo  Classe  Sobreviveu
890   32.0    male       3           0
889   26.0    male       1           1
888    NaN  female       3           0
887   19.0  female       1           1
886   27.0    male       2           0
885   39.0  female       3           0
884   25.0    male       3           0
883   28.0    male       2           0
882   22.0  female       3           0
881   33.0    male       3           0
880   25.0  female       2           1
879   56.0  female       1           1
878    NaN    male       3           0
877   19.0    male       3           0
876   20.0    male       3           0
875   15.0  female       3           1
874   28.0  female       2           1
873   47.0    male       3           0
872   33.0    male       1           0
871   47.0  female       1           1
870   26.0    male       3           0
869    4.0    male       3           1
868    NaN    male       3           0
867   31.0    male       1           0
866   27.0  female       2           1
865   42.0  female       2           1
864   24.0    male       2           0
863    NaN  female       3           0
862   48.0  female       1           1
861   21.0    male       2           0
..     ...     ...     ...         ...
29     NaN    male       3           0
28     NaN  female       3           1
27    19.0    male       1           0
26     NaN    male       3           0
25    38.0  female       3           1
24     8.0  female       3           0
23    28.0    male       1           1
22    15.0  female       3           1
21    34.0    male       2           1
20    35.0    male       2           0
19     NaN  female       3           1
18    31.0  female       3           0
17     NaN    male       2           1
16     2.0    male       3           0
15    55.0  female       2           1
14    14.0  female       3           0
13    39.0    male       3           0
12    20.0    male       3           0
11    58.0  female       1           1
10     4.0  female       3           1
9     14.0  female       2           1
8     27.0  female       3           1
7      2.0    male       3           0
6     54.0    male       1           0
5      NaN    male       3           0
4     35.0    male       3           0
3     35.0  female       1           1
2     26.0  female       3           1
1     38.0  female       1           1
0     22.0    male       3           0

[891 rows x 4 columns]

## Manipulandos dados nulos, NaN e etc.

In [25]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [26]:
data.loc[data['Embarque'].isnull()]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [27]:
data['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [28]:
data['Embarque'].mode()

0    S
dtype: object

In [29]:
data.describe(include='O')

                                Nome  Sexo Bilhete Cabine Embarque
count                            891   891     891    204      889
unique                           891     2     681    147        3
top     Nicholson, Mr. Arthur Ernest  male    1601     G6        S
freq                               1   577       7      4      644

In [30]:
644/889

0.7244094488188977

In [31]:
data['Embarque'].fillna('S', inplace=True)

In [32]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

In [33]:
data['Embarque'].at[61]

'S'

## Deletando coluna/linha

In [34]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

In [35]:
data['Cabine'].head(3)

0    NaN
1    C85
2    NaN
Name: Cabine, dtype: object

In [36]:
## axis = 0 coluna
## axis = 1 linha
data.drop('Cabine', axis=0, inplace=True)

KeyError: "['Cabine'] not found in axis"

In [37]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

In [38]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

## Apply e Lambda

In [39]:
data['Idade'].apply(lambda x: x ** 2)

0       484.0
1      1444.0
2       676.0
3      1225.0
4      1225.0
5         NaN
6      2916.0
7         4.0
8       729.0
9       196.0
10       16.0
11     3364.0
12      400.0
13     1521.0
14      196.0
15     3025.0
16        4.0
17        NaN
18      961.0
19        NaN
20     1225.0
21     1156.0
22      225.0
23      784.0
24       64.0
25     1444.0
26        NaN
27      361.0
28        NaN
29        NaN
        ...
861     441.0
862    2304.0
863       NaN
864     576.0
865    1764.0
866     729.0
867     961.0
868       NaN
869      16.0
870     676.0
871    2209.0
872    1089.0
873    2209.0
874     784.0
875     225.0
876     400.0
877     361.0
878       NaN
879    3136.0
880     625.0
881    1089.0
882     484.0
883     784.0
884     625.0
885    1521.0
886     729.0
887     361.0
888       NaN
889     676.0
890    1024.0
Name: Idade, Length: 891, dtype: float64

In [40]:
data['Tarifa'].apply(lambda x: x*0.30).head(1)

0    2.175
Name: Tarifa, dtype: float64

In [41]:
data['Bilhete'].sort_values()

504               110152
257               110152
759               110152
262               110413
558               110413
585               110413
110               110465
475               110465
430               110564
366               110813
170               111240
462               111320
523               111361
329               111361
889               111369
604               111426
507               111427
187               111428
806               112050
633               112052
887               112053
815               112058
263               112059
209               112277
766               112379
711               113028
331               113043
536               113050
452               113051
857               113055
             ...
433    STON/O 2. 3101274
243    STON/O 2. 3101275
173    STON/O 2. 3101280
664    STON/O 2. 3101285
579    STON/O 2. 3101286
744    STON/O 2. 3101288
400    STON/O 2. 3101289
636    STON/O 2. 3101292
382    STON/O 2. 3101293
115    STON/O 2. 3101294
729     STON/O2. 3101271
142     STON/O2. 3101279
403     STON/O2. 3101279
2       STON/O2. 3101282
216     STON/O2. 3101283
816     STON/O2. 3101290
226            SW/PP 751
526          W./C. 14258
242          W./C. 14263
783           W./C. 6607
888           W./C. 6607
147           W./C. 6608
436           W./C. 6608
86            W./C. 6608
736           W./C. 6608
235           W./C. 6609
92           W.E.P. 5734
219            W/C 14208
540            WE/P 5735
745            WE/P 5735
Name: Bilhete, Length: 891, dtype: object

In [42]:
data['Bilhete'] = data['Bilhete'].apply(lambda x: x[:-1])

In [43]:
data['Bilhete']

0             A/5 2117
1              PC 1759
2      STON/O2. 310128
3                11380
4                37345
5                33087
6                 1746
7                34990
8                34774
9                23773
10              PP 954
11               11378
12            A/5. 215
13               34708
14               35040
15               24870
16               38265
17               24437
18               34576
19                 264
20               23986
21               24869
22               33092
23               11378
24               34990
25               34707
26                 263
27                1995
28               33095
29               34921
            ...
861               2813
862               1746
863            CA. 234
864              23386
865              23685
866       SC/PARIS 214
867            PC 1759
868              34577
869              34774
870              34924
871               1175
872                 69
873              34576
874           P/PP 338
875                266
876                753
877              34921
878              34921
879               1176
880              23043
881              34925
882                755
883    C.A./SOTON 3406
884     SOTON/OQ 39207
885              38265
886              21153
887              11205
888          W./C. 660
889              11136
890              37037
Name: Bilhete, Length: 891, dtype: object

## VariÃ¡veis dummy | HotEncoder

In [44]:
## Divide a coluna em duas ou mais para analisar melhor o valor
## neste exemplo divide em Sexo_male e Sexo_female
## para o aprendizado de mÃ¡quina Ã© melhor pelo motivo dos valores serem transformados em 0 e 1 ao invÃ©s
## dos valores reais
## aumentando a capacidade do computador de processar estes dados
pd.get_dummies(data, columns=['Sexo'])

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque,Sexo_female,Sexo_male
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C85,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,NaN,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,C123,S,1,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,NaN,S,0,1
5,6,0,3,"Moran, Mr. James",NaN,0,0,33087,8.4583,NaN,Q,0,1
6,7,0,1,"McCarthy, Mr. Timothy J",54.0,0,0,1746,51.8625,E46,S,0,1
7,8,0,3,"Palsson, Master. Gosta Leonard",2.0,3,1,34990,21.0750,NaN,S,0,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",27.0,0,2,34774,11.1333,NaN,S,1,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",14.0,1,0,23773,30.0708,NaN,C,1,0
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",4.0,1,1,PP 954,16.7000,G6,S,1,0
11,12,1,1,"Bonnell, Miss. Elizabeth",58.0,0,0,11378,26.5500,C103,S,1,0
12,13,0,3,"Saundercock, Mr. William Henry",20.0,0,0,A/5. 215,8.0500,NaN,S,0,1
13,14,0,3,"Andersson, Mr. Anders Johan",39.0,1,5,34708,31.2750,NaN,S,0,1
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",14.0,0,0,35040,7.8542,NaN,S,1,0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",55.0,0,0,24870,16.0000,NaN,S,1,0
16,17,0,3,"Rice, Master. Eugene",2.0,4,1,38265,29.1250,NaN,Q,0,1
17,18,1,2,"Williams, Mr. Charles Eugene",NaN,0,0,24437,13.0000,NaN,S,0,1
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",31.0,1,0,34576,18.0000,NaN,S,1,0
19,20,1,3,"Masselmani, Mrs. Fatima",NaN,0,0,264,7.2250,NaN,C,1,0
20,21,0,2,"Fynney, Mr. Joseph J",35.0,0,0,23986,26.0000,NaN,S,0,1
21,22,1,2,"Beesley, Mr. Lawrence",34.0,0,0,24869,13.0000,D56,S,0,1
22,23,1,3,"McGowan, Miss. Anna ""Annie""",15.0,0,0,33092,8.0292,NaN,Q,1,0
23,24,1,1,"Sloper, Mr. William Thompson",28.0,0,0,11378,35.5000,A6,S,0,1
24,25,0,3,"Palsson, Miss. Torborg Danira",8.0,3,1,34990,21.0750,NaN,S,1,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",38.0,1,5,34707,31.3875,NaN,S,1,0
26,27,0,3,"Emir, Mr. Farred Chehab",NaN,0,0,263,7.2250,NaN,C,0,1
27,28,0,1,"Fortune, Mr. Charles Alexander",19.0,3,2,1995,263.0000,C23 C25 C27,S,0,1
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",NaN,0,0,33095,7.8792,NaN,Q,1,0
29,30,0,3,"Todoroff, Mr. Lalio",NaN,0,0,34921,7.8958,NaN,S,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",21.0,1,0,2813,11.5000,NaN,S,0,1
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",48.0,0,0,1746,25.9292,D17,S,1,0
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",NaN,8,2,CA. 234,69.5500,NaN,S,1,0
864,865,0,2,"Gill, Mr. John William",24.0,0,0,23386,13.0000,NaN,S,0,1
865,866,1,2,"Bystrom, Mrs. (Karolina)",42.0,0,0,23685,13.0000,NaN,S,1,0
866,867,1,2,"Duran y More, Miss. Asuncion",27.0,1,0,SC/PARIS 214,13.8583,NaN,C,1,0
867,868,0,1,"Roebling, Mr. Washington Augustus II",31.0,0,0,PC 1759,50.4958,A24,S,0,1
868,869,0,3,"van Melkebeke, Mr. Philemon",NaN,0,0,34577,9.5000,NaN,S,0,1
869,870,1,3,"Johnson, Master. Harold Theodor",4.0,1,1,34774,11.1333,NaN,S,0,1
870,871,0,3,"Balkic, Mr. Cerin",26.0,0,0,34924,7.8958,NaN,S,0,1
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",47.0,1,1,1175,52.5542,D35,S,1,0
872,873,0,1,"Carlsson, Mr. Frans Olof",33.0,0,0,69,5.0000,B51 B53 B55,S,0,1
873,874,0,3,"Vander Cruyssen, Mr. Victor",47.0,0,0,34576,9.0000,NaN,S,0,1
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",28.0,1,0,P/PP 338,24.0000,NaN,C,1,0
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",15.0,0,0,266,7.2250,NaN,C,1,0
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",20.0,0,0,753,9.8458,NaN,S,0,1
877,878,0,3,"Petroff, Mr. Nedelio",19.0,0,0,34921,7.8958,NaN,S,0,1
878,879,0,3,"Laleff, Mr. Kristo",NaN,0,0,34921,7.8958,NaN,S,0,1
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",56.0,0,1,1176,83.1583,C50,C,1,0
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",25.0,0,1,23043,26.0000,NaN,S,1,0
881,882,0,3,"Markun, Mr. Johann",33.0,0,0,34925,7.8958,NaN,S,0,1
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",22.0,0,0,755,10.5167,NaN,S,1,0
883,884,0,2,"Banfield, Mr. Frederick James",28.0,0,0,C.A./SOTON 3406,10.5000,NaN,S,0,1
884,885,0,3,"Sutehall, Mr. Henry Jr",25.0,0,0,SOTON/OQ 39207,7.0500,NaN,S,0,1
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",39.0,0,5,38265,29.1250,NaN,Q,1,0
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,21153,13.0000,NaN,S,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,11205,30.0000,B42,S,1,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 660,23.4500,NaN,S,1,0
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,11136,30.0000,C148,C,0,1
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,37037,7.7500,NaN,Q,0,1

In [45]:
## drop_first dropa a coluna gerada pelo get_dummies
pd.get_dummies(data, columns=['Sexo'], drop_first=True)

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque,Sexo_male
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,NaN,S,1
5,6,0,3,"Moran, Mr. James",NaN,0,0,33087,8.4583,NaN,Q,1
6,7,0,1,"McCarthy, Mr. Timothy J",54.0,0,0,1746,51.8625,E46,S,1
7,8,0,3,"Palsson, Master. Gosta Leonard",2.0,3,1,34990,21.0750,NaN,S,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",27.0,0,2,34774,11.1333,NaN,S,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",14.0,1,0,23773,30.0708,NaN,C,0
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",4.0,1,1,PP 954,16.7000,G6,S,0
11,12,1,1,"Bonnell, Miss. Elizabeth",58.0,0,0,11378,26.5500,C103,S,0
12,13,0,3,"Saundercock, Mr. William Henry",20.0,0,0,A/5. 215,8.0500,NaN,S,1
13,14,0,3,"Andersson, Mr. Anders Johan",39.0,1,5,34708,31.2750,NaN,S,1
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",14.0,0,0,35040,7.8542,NaN,S,0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",55.0,0,0,24870,16.0000,NaN,S,0
16,17,0,3,"Rice, Master. Eugene",2.0,4,1,38265,29.1250,NaN,Q,1
17,18,1,2,"Williams, Mr. Charles Eugene",NaN,0,0,24437,13.0000,NaN,S,1
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",31.0,1,0,34576,18.0000,NaN,S,0
19,20,1,3,"Masselmani, Mrs. Fatima",NaN,0,0,264,7.2250,NaN,C,0
20,21,0,2,"Fynney, Mr. Joseph J",35.0,0,0,23986,26.0000,NaN,S,1
21,22,1,2,"Beesley, Mr. Lawrence",34.0,0,0,24869,13.0000,D56,S,1
22,23,1,3,"McGowan, Miss. Anna ""Annie""",15.0,0,0,33092,8.0292,NaN,Q,0
23,24,1,1,"Sloper, Mr. William Thompson",28.0,0,0,11378,35.5000,A6,S,1
24,25,0,3,"Palsson, Miss. Torborg Danira",8.0,3,1,34990,21.0750,NaN,S,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",38.0,1,5,34707,31.3875,NaN,S,0
26,27,0,3,"Emir, Mr. Farred Chehab",NaN,0,0,263,7.2250,NaN,C,1
27,28,0,1,"Fortune, Mr. Charles Alexander",19.0,3,2,1995,263.0000,C23 C25 C27,S,1
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",NaN,0,0,33095,7.8792,NaN,Q,0
29,30,0,3,"Todoroff, Mr. Lalio",NaN,0,0,34921,7.8958,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",21.0,1,0,2813,11.5000,NaN,S,1
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",48.0,0,0,1746,25.9292,D17,S,0
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",NaN,8,2,CA. 234,69.5500,NaN,S,0
864,865,0,2,"Gill, Mr. John William",24.0,0,0,23386,13.0000,NaN,S,1
865,866,1,2,"Bystrom, Mrs. (Karolina)",42.0,0,0,23685,13.0000,NaN,S,0
866,867,1,2,"Duran y More, Miss. Asuncion",27.0,1,0,SC/PARIS 214,13.8583,NaN,C,0
867,868,0,1,"Roebling, Mr. Washington Augustus II",31.0,0,0,PC 1759,50.4958,A24,S,1
868,869,0,3,"van Melkebeke, Mr. Philemon",NaN,0,0,34577,9.5000,NaN,S,1
869,870,1,3,"Johnson, Master. Harold Theodor",4.0,1,1,34774,11.1333,NaN,S,1
870,871,0,3,"Balkic, Mr. Cerin",26.0,0,0,34924,7.8958,NaN,S,1
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",47.0,1,1,1175,52.5542,D35,S,0
872,873,0,1,"Carlsson, Mr. Frans Olof",33.0,0,0,69,5.0000,B51 B53 B55,S,1
873,874,0,3,"Vander Cruyssen, Mr. Victor",47.0,0,0,34576,9.0000,NaN,S,1
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",28.0,1,0,P/PP 338,24.0000,NaN,C,0
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",15.0,0,0,266,7.2250,NaN,C,0
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",20.0,0,0,753,9.8458,NaN,S,1
877,878,0,3,"Petroff, Mr. Nedelio",19.0,0,0,34921,7.8958,NaN,S,1
878,879,0,3,"Laleff, Mr. Kristo",NaN,0,0,34921,7.8958,NaN,S,1
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",56.0,0,1,1176,83.1583,C50,C,0
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",25.0,0,1,23043,26.0000,NaN,S,0
881,882,0,3,"Markun, Mr. Johann",33.0,0,0,34925,7.8958,NaN,S,1
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",22.0,0,0,755,10.5167,NaN,S,0
883,884,0,2,"Banfield, Mr. Frederick James",28.0,0,0,C.A./SOTON 3406,10.5000,NaN,S,1
884,885,0,3,"Sutehall, Mr. Henry Jr",25.0,0,0,SOTON/OQ 39207,7.0500,NaN,S,1
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",39.0,0,5,38265,29.1250,NaN,Q,0
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,21153,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,11205,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 660,23.4500,NaN,S,0
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,11136,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,37037,7.7500,NaN,Q,1

In [46]:
data = pd.get_dummies(data, columns=['Sexo'], drop_first=True)

In [47]:
pd.get_dummies(data['Embarque'])

     C  Q  S
0    0  0  1
1    1  0  0
2    0  0  1
3    0  0  1
4    0  0  1
5    0  1  0
6    0  0  1
7    0  0  1
8    0  0  1
9    1  0  0
10   0  0  1
11   0  0  1
12   0  0  1
13   0  0  1
14   0  0  1
15   0  0  1
16   0  1  0
17   0  0  1
18   0  0  1
19   1  0  0
20   0  0  1
21   0  0  1
22   0  1  0
23   0  0  1
24   0  0  1
25   0  0  1
26   1  0  0
27   0  0  1
28   0  1  0
29   0  0  1
..  .. .. ..
861  0  0  1
862  0  0  1
863  0  0  1
864  0  0  1
865  0  0  1
866  1  0  0
867  0  0  1
868  0  0  1
869  0  0  1
870  0  0  1
871  0  0  1
872  0  0  1
873  0  0  1
874  1  0  0
875  1  0  0
876  0  0  1
877  0  0  1
878  0  0  1
879  1  0  0
880  0  0  1
881  0  0  1
882  0  0  1
883  0  0  1
884  0  0  1
885  0  1  0
886  0  0  1
887  0  0  1
888  0  0  1
889  1  0  0
890  0  1  0

[891 rows x 3 columns]

In [48]:
##data = pd.get_dummies(data['Embarque'], drop_first=True)

In [49]:
embarque = pd.get_dummies(data['Embarque'], drop_first=True)

## ConcatenaÃ§Ã£o de dataframes

In [50]:
##Para concatenar o numero de linhas deve ser identico
data = pd.concat([data,embarque], axis=1)

## ExpressÃµes regulares
.  -> qualquer caracter
<br>
\d -> digitos (0-9)
<br>
\D -> exceto digitos (0-9)
<br>
\w -> palavra (a-z, A-Z, 0-9, _)
<br>
\s -> espaÃ§o em branco (tab, espaÃ§o, nova linha)
<br>
\S -> qualquer coisa exceto espaÃ§o em branco (tab, espaÃ§o, nova linha)
<br>
\b -> inicio de uma palavra
<br>
\B -> exceto inicio da palavra
<br>
Ë†  -> inicio de uma String
<br>
$  -> final de uma string
<br>
[] -> caracteres em colchetes
<br>
[^]-> caracteres e nÃ£o colchetes
<br>
|  -> ou
<br>
() -> grupo 
<br><br>
'*'     -> nenhum ou mais
<br>
'+'     -> um ou mais
<br>
?     -> nenhum ou um
<br>
{3}   -> numero exato
<br>
{3,4} -> range de numeros (minimo, maximo)

In [51]:
data['Nome'].iloc[[18, 8]]

18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Nome, dtype: object

In [52]:
## ExpressÃ£o regular que pega todos as linha que a coluna nome contÃ©m um ponto (pega o tÃ­tulo no caso)
data['Nome'].str.extract('([a-zA-Z]+)\.')

          0
0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
5        Mr
6        Mr
7    Master
8       Mrs
9       Mrs
10     Miss
11     Miss
12       Mr
13       Mr
14     Miss
15      Mrs
16   Master
17       Mr
18      Mrs
19      Mrs
20       Mr
21       Mr
22     Miss
23       Mr
24     Miss
25      Mrs
26       Mr
27       Mr
28     Miss
29       Mr
..      ...
861      Mr
862     Mrs
863    Miss
864      Mr
865     Mrs
866    Miss
867      Mr
868      Mr
869  Master
870      Mr
871     Mrs
872      Mr
873      Mr
874     Mrs
875    Miss
876      Mr
877      Mr
878      Mr
879     Mrs
880     Mrs
881      Mr
882    Miss
883      Mr
884      Mr
885     Mrs
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr

[891 rows x 1 columns]

In [53]:
data['Titulo'] = data['Nome'].str.extract('([a-zA-Z]+)\.')

In [54]:
data

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque,Sexo_male,Q,S,Titulo
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,NaN,S,1,0,1,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C85,C,0,0,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,NaN,S,0,0,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,C123,S,0,0,1,Mrs
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,NaN,S,1,0,1,Mr
5,6,0,3,"Moran, Mr. James",NaN,0,0,33087,8.4583,NaN,Q,1,1,0,Mr
6,7,0,1,"McCarthy, Mr. Timothy J",54.0,0,0,1746,51.8625,E46,S,1,0,1,Mr
7,8,0,3,"Palsson, Master. Gosta Leonard",2.0,3,1,34990,21.0750,NaN,S,1,0,1,Master
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",27.0,0,2,34774,11.1333,NaN,S,0,0,1,Mrs
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",14.0,1,0,23773,30.0708,NaN,C,0,0,0,Mrs
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",4.0,1,1,PP 954,16.7000,G6,S,0,0,1,Miss
11,12,1,1,"Bonnell, Miss. Elizabeth",58.0,0,0,11378,26.5500,C103,S,0,0,1,Miss
12,13,0,3,"Saundercock, Mr. William Henry",20.0,0,0,A/5. 215,8.0500,NaN,S,1,0,1,Mr
13,14,0,3,"Andersson, Mr. Anders Johan",39.0,1,5,34708,31.2750,NaN,S,1,0,1,Mr
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",14.0,0,0,35040,7.8542,NaN,S,0,0,1,Miss
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",55.0,0,0,24870,16.0000,NaN,S,0,0,1,Mrs
16,17,0,3,"Rice, Master. Eugene",2.0,4,1,38265,29.1250,NaN,Q,1,1,0,Master
17,18,1,2,"Williams, Mr. Charles Eugene",NaN,0,0,24437,13.0000,NaN,S,1,0,1,Mr
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",31.0,1,0,34576,18.0000,NaN,S,0,0,1,Mrs
19,20,1,3,"Masselmani, Mrs. Fatima",NaN,0,0,264,7.2250,NaN,C,0,0,0,Mrs
20,21,0,2,"Fynney, Mr. Joseph J",35.0,0,0,23986,26.0000,NaN,S,1,0,1,Mr
21,22,1,2,"Beesley, Mr. Lawrence",34.0,0,0,24869,13.0000,D56,S,1,0,1,Mr
22,23,1,3,"McGowan, Miss. Anna ""Annie""",15.0,0,0,33092,8.0292,NaN,Q,0,1,0,Miss
23,24,1,1,"Sloper, Mr. William Thompson",28.0,0,0,11378,35.5000,A6,S,1,0,1,Mr
24,25,0,3,"Palsson, Miss. Torborg Danira",8.0,3,1,34990,21.0750,NaN,S,0,0,1,Miss
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",38.0,1,5,34707,31.3875,NaN,S,0,0,1,Mrs
26,27,0,3,"Emir, Mr. Farred Chehab",NaN,0,0,263,7.2250,NaN,C,1,0,0,Mr
27,28,0,1,"Fortune, Mr. Charles Alexander",19.0,3,2,1995,263.0000,C23 C25 C27,S,1,0,1,Mr
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",NaN,0,0,33095,7.8792,NaN,Q,0,1,0,Miss
29,30,0,3,"Todoroff, Mr. Lalio",NaN,0,0,34921,7.8958,NaN,S,1,0,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",21.0,1,0,2813,11.5000,NaN,S,1,0,1,Mr
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",48.0,0,0,1746,25.9292,D17,S,0,0,1,Mrs
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",NaN,8,2,CA. 234,69.5500,NaN,S,0,0,1,Miss
864,865,0,2,"Gill, Mr. John William",24.0,0,0,23386,13.0000,NaN,S,1,0,1,Mr
865,866,1,2,"Bystrom, Mrs. (Karolina)",42.0,0,0,23685,13.0000,NaN,S,0,0,1,Mrs
866,867,1,2,"Duran y More, Miss. Asuncion",27.0,1,0,SC/PARIS 214,13.8583,NaN,C,0,0,0,Miss
867,868,0,1,"Roebling, Mr. Washington Augustus II",31.0,0,0,PC 1759,50.4958,A24,S,1,0,1,Mr
868,869,0,3,"van Melkebeke, Mr. Philemon",NaN,0,0,34577,9.5000,NaN,S,1,0,1,Mr
869,870,1,3,"Johnson, Master. Harold Theodor",4.0,1,1,34774,11.1333,NaN,S,1,0,1,Master
870,871,0,3,"Balkic, Mr. Cerin",26.0,0,0,34924,7.8958,NaN,S,1,0,1,Mr
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",47.0,1,1,1175,52.5542,D35,S,0,0,1,Mrs
872,873,0,1,"Carlsson, Mr. Frans Olof",33.0,0,0,69,5.0000,B51 B53 B55,S,1,0,1,Mr
873,874,0,3,"Vander Cruyssen, Mr. Victor",47.0,0,0,34576,9.0000,NaN,S,1,0,1,Mr
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",28.0,1,0,P/PP 338,24.0000,NaN,C,0,0,0,Mrs
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",15.0,0,0,266,7.2250,NaN,C,0,0,0,Miss
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",20.0,0,0,753,9.8458,NaN,S,1,0,1,Mr
877,878,0,3,"Petroff, Mr. Nedelio",19.0,0,0,34921,7.8958,NaN,S,1,0,1,Mr
878,879,0,3,"Laleff, Mr. Kristo",NaN,0,0,34921,7.8958,NaN,S,1,0,1,Mr
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",56.0,0,1,1176,83.1583,C50,C,0,0,0,Mrs
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",25.0,0,1,23043,26.0000,NaN,S,0,0,1,Mrs
881,882,0,3,"Markun, Mr. Johann",33.0,0,0,34925,7.8958,NaN,S,1,0,1,Mr
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",22.0,0,0,755,10.5167,NaN,S,0,0,1,Miss
883,884,0,2,"Banfield, Mr. Frederick James",28.0,0,0,C.A./SOTON 3406,10.5000,NaN,S,1,0,1,Mr
884,885,0,3,"Sutehall, Mr. Henry Jr",25.0,0,0,SOTON/OQ 39207,7.0500,NaN,S,1,0,1,Mr
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",39.0,0,5,38265,29.1250,NaN,Q,0,1,0,Mrs
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,21153,13.0000,NaN,S,1,0,1,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,11205,30.0000,B42,S,0,0,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 660,23.4500,NaN,S,0,0,1,Miss
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,11136,30.0000,C148,C,1,0,0,Mr
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,37037,7.7500,NaN,Q,1,1,0,Mr

In [55]:
##Pega qualquer texto que tenha a palavra um espaÃ§o em branco e a palavra Owen
data['Nome'].str.extract('(.+)\W\sOwen')

              0
0    Braund, Mr
1           NaN
2           NaN
3           NaN
4           NaN
5           NaN
6           NaN
7           NaN
8           NaN
9           NaN
10          NaN
11          NaN
12          NaN
13          NaN
14          NaN
15          NaN
16          NaN
17          NaN
18          NaN
19          NaN
20          NaN
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26          NaN
27          NaN
28          NaN
29          NaN
..          ...
861         NaN
862         NaN
863         NaN
864         NaN
865         NaN
866         NaN
867         NaN
868         NaN
869         NaN
870         NaN
871         NaN
872         NaN
873         NaN
874         NaN
875         NaN
876         NaN
877         NaN
878         NaN
879         NaN
880         NaN
881         NaN
882         NaN
883         NaN
884         NaN
885         NaN
886         NaN
887         NaN
888         NaN
889         NaN
890         NaN

[891 rows x 1 columns]

In [56]:
data['Nome']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
5                                       Moran, Mr. James
6                                McCarthy, Mr. Timothy J
7                         Palsson, Master. Gosta Leonard
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
10                       Sandstrom, Miss. Marguerite Rut
11                              Bonnell, Miss. Elizabeth
12                        Saundercock, Mr. William Henry
13                           Andersson, Mr. Anders Johan
14                  Vestrom, Miss. Hulda Amanda Adolfina
15                      Hewlett, Mrs. (Mary D Kingcome)
16                                  Rice, Master. Eugene
17                          Williams, Mr. Charles Eugene
18     Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                               Masselmani, Mrs. Fatima
20                                  Fynney, Mr. Joseph J
21                                 Beesley, Mr. Lawrence
22                           McGowan, Miss. Anna "Annie"
23                          Sloper, Mr. William Thompson
24                         Palsson, Miss. Torborg Danira
25     Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
26                               Emir, Mr. Farred Chehab
27                        Fortune, Mr. Charles Alexander
28                         O'Dwyer, Miss. Ellen "Nellie"
29                                   Todoroff, Mr. Lalio
                             ...
861                          Giles, Mr. Frederick Edward
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
864                               Gill, Mr. John William
865                             Bystrom, Mrs. (Karolina)
866                         Duran y More, Miss. Asuncion
867                 Roebling, Mr. Washington Augustus II
868                          van Melkebeke, Mr. Philemon
869                      Johnson, Master. Harold Theodor
870                                    Balkic, Mr. Cerin
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
873                          Vander Cruyssen, Mr. Victor
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
876                        Gustafsson, Mr. Alfred Ossian
877                                 Petroff, Mr. Nedelio
878                                   Laleff, Mr. Kristo
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
881                                   Markun, Mr. Johann
882                         Dahlberg, Miss. Gerda Ulrika
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
885                 Rice, Mrs. William (Margaret Norton)
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Nome, Length: 891, dtype: object

In [72]:
##Pega qualquer texto que tenha o caractere '('
data['Nome'].str.extract('(.+)\s\(')

                                  0
0                               NaN
1        Cumings, Mrs. John Bradley
2                               NaN
3      Futrelle, Mrs. Jacques Heath
4                               NaN
5                               NaN
6                               NaN
7                               NaN
8             Johnson, Mrs. Oscar W
9             Nasser, Mrs. Nicholas
10                              NaN
11                              NaN
12                              NaN
13                              NaN
14                              NaN
15                    Hewlett, Mrs.
16                              NaN
17                              NaN
18       Vander Planke, Mrs. Julius
19                              NaN
20                              NaN
21                              NaN
22                              NaN
23                              NaN
24                              NaN
25         Asplund, Mrs. Carl Oscar
26                              NaN
27                              NaN
28                              NaN
29                              NaN
..                              ...
861                             NaN
862      Swift, Mrs. Frederick Joel
863                             NaN
864                             NaN
865                   Bystrom, Mrs.
866                             NaN
867                             NaN
868                             NaN
869                             NaN
870                             NaN
871  Beckwith, Mrs. Richard Leonard
872                             NaN
873                             NaN
874            Abelson, Mrs. Samuel
875                             NaN
876                             NaN
877                             NaN
878                             NaN
879          Potter, Mrs. Thomas Jr
880           Shelley, Mrs. William
881                             NaN
882                             NaN
883                             NaN
884                             NaN
885              Rice, Mrs. William
886                             NaN
887                             NaN
888                             NaN
889                             NaN
890                             NaN

[891 rows x 1 columns]

In [90]:
##Pega qualquer texto que tenha o caractere 'y'
data['Nome'].str.extract('(^.*y.*$)')

                                                     0
0                                                  NaN
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                                  NaN
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                                  NaN
6                              McCarthy, Mr. Timothy J
7                                                  NaN
8                                                  NaN
9                                                  NaN
10                                                 NaN
11                                                 NaN
12                      Saundercock, Mr. William Henry
13                                                 NaN
14                                                 NaN
15                    Hewlett, Mrs. (Mary D Kingcome)
16                                                 NaN
17                                                 NaN
18                                                 NaN
19                                                 NaN
20                                Fynney, Mr. Joseph J
21                               Beesley, Mr. Lawrence
22                                                 NaN
23                                                 NaN
24                                                 NaN
25                                                 NaN
26                                                 NaN
27                                                 NaN
28                       O'Dwyer, Miss. Ellen "Nellie"
29                                                 NaN
..                                                 ...
861                                                NaN
862                                                NaN
863                  Sage, Miss. Dorothy Edith "Dolly"
864                                                NaN
865                           Bystrom, Mrs. (Karolina)
866                       Duran y More, Miss. Asuncion
867                                                NaN
868                                                NaN
869                                                NaN
870                                                NaN
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                                                NaN
873                        Vander Cruyssen, Mr. Victor
874              Abelson, Mrs. Samuel (Hannah Wizosky)
875                                                NaN
876                                                NaN
877                                                NaN
878                                                NaN
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880       Shelley, Mrs. William (Imanita Parrish Hall)
881                                                NaN
882                                                NaN
883                                                NaN
884                             Sutehall, Mr. Henry Jr
885                                                NaN
886                                                NaN
887                                                NaN
888                                                NaN
889                                                NaN
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

## Engenharia de recursos - Feature Engineering

In [96]:
data['Sexo'] = data['Sexo_male'].map({0: 'mulher', 1: 'homem'})

In [98]:
pd.crosstab(data['Titulo'], data['Sexo'])

Sexo      homem  mulher
Titulo
Capt          1       0
Col           2       0
Countess      0       1
Don           1       0
Dr            6       1
Jonkheer      1       0
Lady          0       1
Major         2       0
Master       40       0
Miss          0     182
Mlle          0       2
Mme           0       1
Mr          517       0
Mrs           0     125
Ms            0       1
Rev           6       0
Sir           1       0

In [99]:
data['Titulo'].apply(lambda x: 'Outros' if x not in ['Master', 'Miss', 'Mr', 'Mrs'] else x)

0          Mr
1         Mrs
2        Miss
3         Mrs
4          Mr
5          Mr
6          Mr
7      Master
8         Mrs
9         Mrs
10       Miss
11       Miss
12         Mr
13         Mr
14       Miss
15        Mrs
16     Master
17         Mr
18        Mrs
19        Mrs
20         Mr
21         Mr
22       Miss
23         Mr
24       Miss
25        Mrs
26         Mr
27         Mr
28       Miss
29         Mr
        ...
861        Mr
862       Mrs
863      Miss
864        Mr
865       Mrs
866      Miss
867        Mr
868        Mr
869    Master
870        Mr
871       Mrs
872        Mr
873        Mr
874       Mrs
875      Miss
876        Mr
877        Mr
878        Mr
879       Mrs
880       Mrs
881        Mr
882      Miss
883        Mr
884        Mr
885       Mrs
886    Outros
887      Miss
888      Miss
889        Mr
890        Mr
Name: Titulo, Length: 891, dtype: object

In [103]:
data['Titulo'] = data['Titulo'].apply(lambda x: 'Outros' if x not in ['Master', 'Miss', 'Mr', 'Mrs'] else x)

In [104]:
pd.crosstab(data['Titulo'], data['Sexo'])

Sexo    homem  mulher
Titulo
Master     40       0
Miss        0     182
Mr        517       0
Mrs         0     125
Outros     20       7

## Mudando valores linha a linha - iterrows()

In [106]:
cabine = pd.read_csv('titanic/train.csv')

In [107]:
cabine['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [111]:
for idx, _ in cabine[['Cabin']].dropna().iterrows():
    cabine['Cabin'].at[idx] = cabine['Cabin'].at[idx][0]

In [117]:
cabine[['Cabin', 'Survived', 'Sex', 'Pclass']].dropna().groupby(['Cabin', 'Sex']).count()

              Survived  Pclass
Cabin Sex
A     female         1       1
      male          14      14
B     female        27      27
      male          20      20
C     female        27      27
      male          32      32
D     female        18      18
      male          15      15
E     female        15      15
      male          17      17
F     female         5       5
      male           8       8
G     female         4       4
T     male           1       1